Repository: SAzzinelli/FoodFade
Catalog: *.lproj/Localizable.strings
Languages: it

# stats.message.ok
source: You're trying, well done!
it: Ci stai provando, bravo!

# stats.message.encouraging
source: Every small step counts!
it: Ogni piccolo passo conta!

# stats.costs.title
source: Costs & savings
it: Costi e risparmi

# stats.costs.description
source: Track how much you spend, how much expires unused, and how much you save by using products before they expire. Add prices when you add products to see these stats.
it: Tieni d'occhio quanto spendi, quanto scade senza essere usato e quanto risparmi consumando i prodotti in tempo. Inserisci i prezzi quando aggiungi i prodotti per vedere queste statistiche.

# stats.costs.spent
source: Spent (purchased)
it: Spesa (acquistato)

# stats.costs.wasted
source: Wasted (expired)
it: Sprecato (scaduto)

# stats.costs.saved
source: Saved (used in time)
it: Risparmiato (usato in tempo)

# stats.costs.this_week
source: This week
it: Questa settimana

# stats.costs.this_month
source: This month
it: Questo mese

# stats.costs.this_year
source: This year
it: Questo anno

# stats.costs.price_paid
source: Price
it: Prezzo

# stats.prices.title
source: Price trends
it: Andamento prezzi

# stats.prices.description
source: Overview of prices you've entered: total value, monthly trend, and price per product.
it: Panoramica dei prezzi inseriti: valore totale, andamento mensile e prezzo per singolo prodotto.

# stats.prices.overview
source: Overview
it: Panoramica

# stats.prices.total_tracked
source: Total value tracked
it: Valore totale tracciato

# stats.prices.products_with_price
source: Products with price
it: Prodotti con prezzo

# stats.prices.average
source: Average price
it: Prezzo medio

# stats.prices.trend
source: Spending by month
it: Spesa per mese

# stats.prices.by_product
source: By product
it: Per prodotto

# stats.prices.no_prices
source: No products with price yet. Add a price when adding or editing a product.
it: Nessun prodotto con prezzo. Aggiungi un prezzo quando inserisci o modifichi un prodotto.

# stats.prices.empty_title
source: Empty section
it: Sezione vuota

# stats.prices.empty_why
source: Here you will see total value, monthly trend, and price per product. It's empty because you haven't added any prices yet. When you add a product or edit an existing one, you can enter the price (optional): from then on, this section will show the statistics.
it: Qui vedrai valore totale, andamento mensile e prezzo per prodotto. Per ora è vuota perché non hai ancora inserito nessun prezzo. Quando aggiungi un prodotto o modifichi uno esistente, puoi indicare il prezzo (campo opzionale): da quel momento le statistiche di questa sezione si popoleranno.

# kpi.title.expired
source: Expired
it: Scaduti

# kpi.title.today
source: Expiring today
it: Scadono oggi

# kpi.title.soon
source: Expiring soon
it: Prossimi alla scadenza

# kpi.title.safe
source: Safe items
it: Prodotti sicuri

# settings.title
source: Settings
it: Impostazioni

# settings.appearance
source: Appearance
it: Aspetto

# settings.app_icon.section
source: App icon
it: Icona app

# settings.app_icon.footer
source: Choose the icon to show on the home screen.
it: Scegli l'icona da mostrare sulla home.

# settings.app_icon.error
source: Could not change icon. Try again.
it: Impossibile cambiare icona. Riprova.

# settings.app_icon.error.title
source: Icon not changed
it: Icona non cambiata

# settings.app_icon.changed.title
source: Icon changed
it: Icona cambiata

# settings.app_icon.changed.message
source: You changed the icon to %@.
it: Hai cambiato l'icona in %@.

# settings.ocr_expiration.title
source: Detect expiration from photo
it: Rileva scadenza da foto

# settings.ocr_expiration.footer
source: In Add Product, you can scan the expiration date from a photo. Only the date is read; other text is ignored. May not work on all packages.
it: In Aggiungi prodotto potrai scansionare la data di scadenza da una foto. Viene letta solo la data; il resto del testo viene ignorato. Può non funzionare su tutte le confezioni.

# settings.notifications
source: Notifications
it: Notifiche

# settings.notifications.enable
source: Notifications
it: Notifiche

# settings.notifications.message
source: Receive notifications when your products are about to expire
it: Ricevi notifiche quando i tuoi prodotti stanno per scadere

# settings.notify_me
source: Notify me
it: Avvisami

# settings.notify.same_day
source: Same day
it: Lo stesso giorno

# settings.notify.1day
source: 1 day before
it: 1 giorno prima

# settings.notify.2days
source: 2 days before
it: 2 giorni prima

# settings.sync
source: Synchronization
it: Sincronizzazione

# settings.icloud
source: iCloud Synchronization
it: Sincronizzazione iCloud

# settings.icloud.message
source: Synchronize your data across all devices
it: Sincronizza i tuoi dati tra tutti i dispositivi

# settings.info
source: Information
it: Informazioni

# settings.version
source: Version
it: Versione

# appearance.title
source: Appearance
it: Aspetto

# appearance.mode
source: Appearance
it: Aspetto

# appearance.mode.system
source: System
it: Sistema

# appearance.mode.light
source: Light
it: Chiaro

# appearance.mode.dark
source: Dark
it: Scuro

# appearance.animations
source: Animations
it: Animazioni

# appearance.animations.message
source: Enable or disable animations and visual effects
it: Abilita o disabilita le animazioni e gli effetti visivi

# appearance.accent
source: Main Color
it: Colore Principale

# appearance.accent.message
source: Choose the main color used in the app. 'Default' maintains the original multicolor scheme.
it: Scegli il colore principale utilizzato nell'app. 'Default' mantiene lo schema multicolor originale.

# splash.welcome.masculine
source: Welcome
it: Benvenuto

# splash.welcome.feminine
source: Welcome
it: Benvenuta

# splash.welcome.neutral
source: Welcome
it: Benvenuto

# onboarding.welcome.title
source: Welcome to FoodFade
it: Benvenuto in FoodFade

# onboarding.welcome.subtitle
source: Keep track of expiration dates and avoid waste
it: Tieni sotto controllo le scadenze ed evita sprechi

# onboarding.welcome.feature1.title
source: Add products easily
it: Aggiungi prodotti facilmente

# onboarding.welcome.feature1.description
source: By hand or with scanning
it: A mano o con la scansione

# onboarding.welcome.feature2.title
source: Check expiration dates
it: Controlla le scadenze

# onboarding.welcome.feature2.description
source: You'll always know what to consume first
it: Saprai sempre cosa consumare prima

# onboarding.welcome.feature3.title
source: Reduce waste
it: Riduci gli sprechi

# onboarding.welcome.feature3.description
source: Less food thrown away, without stress
it: Meno cibo buttato, senza stress

# onboarding.welcome.start
source: Start
it: Inizia

# onboarding.help.title
source: We help you not forget anything
it: Ti aiutiamo a non dimenticare nulla

# onboarding.help.text
source: FoodFade shows you right away what's best to consume and alerts you when something is about to expire.
it: FoodFade ti mostra subito cosa è meglio consumare e ti avvisa quando qualcosa sta per scadere.

# onboarding.help.feature1.title
source: Quick choices
it: Scelte rapide

# onboarding.help.feature1.description
source: You'll understand at a glance what to do
it: Capirai a colpo d'occhio cosa fare

# onboarding.help.feature2.title
source: Useful alerts
it: Avvisi utili

# onboarding.help.feature2.description
source: Only when you really need them
it: Solo quando serve davvero

# onboarding.help.continue
source: Continue
it: Continua

# onboarding.cloud.title
source: Where do you want to save your data?
it: Dove vuoi salvare i tuoi dati?

# onboarding.cloud.text
source: You can use FoodFade only on this device or sync your data with iCloud.
it: Puoi usare FoodFade solo su questo dispositivo oppure sincronizzare i dati con iCloud.

# onboarding.cloud.option1.title
source: Use iCloud
it: Usa iCloud

# onboarding.cloud.option1.description
source: Sync products and statistics across all devices linked to the same Apple ID
it: Sincronizza prodotti e statistiche su tutti i dispositivi collegati allo stesso Apple ID

# onboarding.cloud.option1.syncnote
source: Synchronization happens automatically in the background
it: La sincronizzazione avviene automaticamente in background

# onboarding.cloud.option2.title
source: Only on this device
it: Solo su questo dispositivo

# onboarding.cloud.option2.description
source: Data will be saved only on this device
it: I dati verranno salvati solo su questo dispositivo

# onboarding.cloud.note1
source: You can change your mind later in settings
it: Potrai cambiare idea in seguito dalle impostazioni

# onboarding.cloud.note2.icloud
source: You can enable or disable iCloud sync at any time from settings.
it: Puoi attivare o disattivare la sincronizzazione iCloud in qualsiasi momento dalle impostazioni.

# onboarding.cloud.note2.local
source: You can enable iCloud sync at any time from settings.
it: Puoi attivare la sincronizzazione iCloud in qualsiasi momento dalle impostazioni.

# onboarding.cloud.continue
source: Continue
it: Continua

# onboarding.cloud.continue.icloud
source: Continue with iCloud
it: Continua con iCloud

# onboarding.cloud.continue.local
source: Continue without iCloud
it: Continua senza iCloud

# onboarding.notifications.title
source: Don't miss anything
it: Non perdere nulla

# onboarding.notifications.text
source: Enable alerts to remind you what to consume on time.
it: Attiva gli avvisi per ricordarti cosa consumare in tempo.

# onboarding.notifications.feature.title
source: Smart alerts
it: Avvisi intelligenti

# onboarding.notifications.feature.description
source: Receive a reminder before a product expires
it: Ricevi un promemoria prima che un prodotto scada

# onboarding.notifications.enable
source: Enable alerts
it: Abilita avvisi

# onboarding.notifications.enabled
source: Alerts active
it: Avvisi attivi

# onboarding.notifications.skip
source: Skip for now
it: Salta per ora

# onboarding.notifications.continue
source: Continue
it: Continua

# onboarding.name.title
source: What can we call you?
it: Come possiamo chiamarti?

# onboarding.name.label
source: Name
it: Nome

# onboarding.name.placeholder
source: Your name
it: Il tuo nome

# onboarding.name.continue
source: Continue
it: Continua

# onboarding.start.title
source: All set!
it: Tutto pronto!

# onboarding.start.text
source: The app is set up. Start managing expiry dates and products with more control.
it: L'applicazione è configurata. Inizia a gestire scadenze e prodotti con più controllo.

# onboarding.start.bullet1
source: Reduce waste
it: Riduci gli sprechi

# onboarding.start.bullet2
source: Avoid forgotten expiry dates
it: Evita scadenze dimenticate

# onboarding.start.bullet3
source: Keep everything under control
it: Tieni tutto sotto controllo

# onboarding.start.button
source: Let's go
it: Iniziamo

# welcome.save.error.title
source: Save error
it: Errore di salvataggio

# backup.title
source: Backup and Restore
it: Backup e Ripristino

# backup.export.title
source: Manual Backup
it: Backup Manuale

# backup.export.description
source: Export all your data to a JSON file. You can save this file for a local backup or share it.
it: Esporta tutti i tuoi dati in un file JSON. Puoi salvare questo file per un backup locale o condividerlo.

# backup.export.info
source: %d products, %d settings
it: %d prodotti, %d impostazioni

# backup.export.button
source: Export Data
it: Esporta Dati

# backup.export.exporting
source: Exporting...
it: Esportazione in corso...

# backup.export.footer.icloud
source: With iCloud enabled, data syncs automatically. This backup is useful for an additional local backup.
it: Con iCloud attivo, i dati si sincronizzano automaticamente. Questo backup è utile per un backup locale aggiuntivo.

# backup.export.footer.local
source: Export all your data to a JSON file for a local backup.
it: Esporta tutti i tuoi dati in un file JSON per un backup locale.

# backup.import.title
source: Restore Data
it: Ripristina Dati

# backup.import.description
source: Import data from a backup file. You can choose to replace all data or merge it with existing ones.
it: Importa dati da un file di backup. Puoi scegliere di sostituire tutti i dati o unirli a quelli esistenti.

# backup.import.button
source: Import Data
it: Importa Dati

# backup.import.importing
source: Importing...
it: Importazione in corso...

# backup.import.footer.icloud
source: ⚠️ With iCloud enabled, imported data will be synced automatically. Make sure not to create duplicates.
it: ⚠️ Con iCloud attivo, i dati importati verranno sincronizzati automaticamente. Assicurati di non creare duplicati.

# backup.import.footer.local
source: Import data from a backup file.
it: Importa dati da un file di backup.

# backup.mode.title
source: Import Mode
it: Modalità Importazione

# backup.mode.merge
source: Merge (Recommended)
it: Unisci (Consigliato)

# backup.mode.replace
source: Replace Everything
it: Sostituisci Tutto

# backup.mode.message
source: How do you want to import the data? • Merge: adds only new products • Replace: deletes everything and imports from backup
it: Come vuoi importare i dati? • Unisci: aggiunge solo i nuovi prodotti • Sostituisci: elimina tutto e importa dal backup

# backup.result.title
source: Import Result
it: Risultato Importazione

# backup.result.message
source: Imported: %d Updated: %d Skipped: %d Total in backup: %d
it: Importati: %d Aggiornati: %d Saltati: %d Totale nel backup: %d

# settings.backup.title
source: Manual Backup
it: Backup Manuale

# backup.section.title
source: Backup and Restore
it: Backup e Ripristino

# backup.section.footer
source: Export or import your data manually. Useful for local backups or data transfer.
it: Esporta o importa i tuoi dati manualmente. Utile per backup locali o trasferimento dati.

# settings.icloud.restore
source: Restore data from iCloud
it: Ripristina dati da iCloud

# settings.icloud.status.active
source: Active
it: Attiva

# settings.icloud.status.disabled
source: Disabled by user choice
it: Disattivata per scelta dell'utente

# settings.icloud.status.unavailable
source: Not available
it: Non disponibile

# settings.icloud.footer.active
source: Your data is automatically synced across devices linked to the same Apple ID. Use 'Restore data from iCloud' to force synchronization.
it: I tuoi dati vengono sincronizzati automaticamente sui dispositivi collegati allo stesso Apple ID. Usa 'Ripristina dati da iCloud' per forzare la sincronizzazione.

# settings.icloud.footer.unavailable
source: iCloud is not available on this device.
it: iCloud non è disponibile su questo dispositivo.

# settings.reset.footer
source: Delete all data and restore the app to its initial state.
it: Cancella tutti i dati e riporta l'app allo stato iniziale.

# fridgy.toggle
source: Fridgy Suggestions
it: Suggerimenti di Fridgy

# fridgy.available
source: Available
it: Disponibile

# fridgy.unavailable
source: Not available
it: Non disponibile

# fridgy.footer.enabled.available
source: Suggestions and tips based on your inventory.
it: Suggerimenti e consigli in base al tuo inventario.

# fridgy.footer.enabled.unavailable
source: Not available on this device.
it: Non disponibile su questo dispositivo.

# fridgy.footer.disabled
source: Disabled: the app works without intelligent suggestions.
it: Disattivato: l'app funziona senza suggerimenti intelligenti.

# fridgy.footer.beta
source: Beta: may make mistakes. Advice does not replace common sense.
it: Beta: può commettere errori. I consigli non sostituiscono il buon senso.

# fridgy.loading
source: Loading a Fridgy suggestion…
it: Sto caricando un suggerimento di Fridgy…

# fridgy.chat.title
source: Chat with Fridgy
it: Chatta con Fridgy

# fridgy.chat.placeholder
source: Ask about food, storage, waste…
it: Chiedi su cibo, conservazione, sprechi…

# fridgy.chat.send
source: Send
it: Invia

# fridgy.chat.unavailable
source: Enable Fridgy in Settings to chat here.
it: Attiva Fridgy nelle Impostazioni per chattare qui.

# fridgy.chat.error_reply
source: Sorry, I couldn't reply. Please try again.
it: Mi dispiace, non sono riuscito a rispondere. Riprova.

# fridgy.chat.new_title
source: New chat
it: Nuova chat

# fridgy.chat.no_messages
source: No messages
it: Nessun messaggio

# fridgy.chat.empty_prompt
source: Start a chat with Fridgy for advice on food, expiry dates and more!*
it: Inizia una chat con Fridgy per chiedere consigli sul cibo, scadenze e tanto altro!*

# fridgy.chat.empty_disclaimer
source: * The information provided is in beta and under development; it should not be considered reliable or a substitute for common sense.
it: * Le informazioni fornite sono in versione beta e in fase di sviluppo; non vanno considerate attendibili o sostitutive del buon senso.

# assistant.section.title
source: Assistant
it: Assistente

# assistant.toggle
source: Smart suggestions
it: Suggerimenti intelligenti

# assistant.status.available
source: Assistant
it: Assistente

# assistant.status.unavailable
source: Assistant
it: Assistente

# assistant.available
source: Available
it: Disponibile

# assistant.unavailable
source: Not available
it: Non disponibile

# assistant.footer.enabled.available
source: The assistant provides personalized suggestions and tips based on your inventory.
it: L'assistente fornisce suggerimenti personalizzati e consigli in base al tuo inventario.

# assistant.footer.enabled.unavailable
source: The assistant is not available on this device.
it: L'assistente non è disponibile su questo dispositivo.

# assistant.footer.disabled
source: The assistant is disabled. The app works fully without suggestions.
it: L'assistente è disattivato. L'app funziona al 100% senza suggerimenti.

# stats.advice.title
source: A small tip
it: Un piccolo consiglio

# onboarding.cloud.recommended
source: Recommended
it: Consigliata

# addfood.product
source: Product
it: Prodotto

# addfood.additional_info
source: Additional Information
it: Informazioni Aggiuntive

# addfood.is_fresh
source: Is a fresh product
it: È un prodotto fresco

# addfood.expiration_section
source: Expiration
it: Scadenza

# addfood.expiration.auto
source: Expiration will be calculated automatically
it: La scadenza verrà calcolata automaticamente

# addfood.expiration.manual
source: Enter the date indicated on the package
it: Inserisci la data indicata sulla confezione

# addfood.notify_before
source: Before it expires
it: Prima che scada

# addfood.notifications_section
source: Alerts for this product
it: Avvisi per questo prodotto

# addfood.notify.footer
source: You will receive an alert if the product is about to expire
it: Riceverai un avviso se il prodotto sta per scadere

# addfood.dictation.button
source: Dictate expiration date
it: Detta la data di scadenza

# addfood.dictation.listening
source: Listening... Speak the expiration date (e.g. March 7, 2026).
it: Sto ascoltando... Parla per dettare la data di scadenza (es. 7 marzo 2026).

# addfood.dictation.error.title
source: Error
it: Errore

# addfood.dictation.error.message
source: I didn't hear anything..
it: Non ho sentito niente..

# addfood.dictation.error.no_date
source: Date not recognized. Try again (e.g. March 7, 2026).
it: Data non riconosciuta. Riprova (es. 7 marzo 2026).

# addfood.dictation.error.title.no_date
source: Invalid date
it: Data non valida

# addfood.dictation.error.message.no_date
source: Try again.
it: Riprova.

# addfood.dictation.error.title.not_heard
source: I didn't understand..
it: Non ho capito..

# addfood.dictation.error.message.not_heard
source: Can you repeat?
it: Puoi ripetere?

# addfood.ocr.title
source: Scan expiration date
it: Scansiona data di scadenza

# addfood.ocr.prompt
source: Take or choose a photo of the package. Only the expiration date will be read (other text is ignored).
it: Scatta o scegli una foto della confezione. Verrà letta solo la data di scadenza (il resto del testo viene ignorato).

# addfood.ocr.camera
source: Take photo
it: Scatta foto

# addfood.ocr.library
source: Choose from library
it: Scegli da libreria

# addfood.ocr.analyzing
source: Analyzing…
it: Analisi in corso…

# addfood.ocr.no_date.title
source: No date found
it: Nessuna data rilevata

# addfood.ocr.no_date.message
source: No expiration date was found in the image. Try a clearer photo or another package.
it: Non è stata trovata una data di scadenza nell'immagine. Prova con una foto più nitida o un'altra confezione.

# addfood.ocr.button
source: Scan from photo
it: Scansiona da foto

# addfood.where_store
source: WHERE DO YOU STORE IT?
it: DOVE LO CONSERVI?

# addfood.change_date
source: Change
it: Cambia

# addfood.unit_piece
source: Unit: Piece
it: Unità: Pezzo

# addfood.characteristics
source: CHARACTERISTICS
it: CARATTERISTICHE

# addfood.add_notes
source: Add notes
it: Aggiungi note

# addfood.add_notes.optional
source: Optional
it: Opzionale

# addfood.notify_days
source: 3 days before
it: 3 giorni prima

# addfood.notify_days.one
source: 1 day before
it: 1 giorno prima

# addfood.notify_days.many
source: %d days before
it: %d giorni prima

# addfood.barcode.placeholder
source: Scan or enter
it: Scansiona o inserisci

# settings.expiration.section
source: Expiration input
it: Inserimento scadenza

# settings.expiration.input.title
source: Input mode
it: Modalità inserimento

# settings.expiration.input.short
source: Input mode
it: Modalità inserimento

# settings.expiration.calendar
source: Calendar
it: Calendario

# settings.expiration.dictation
source: Dictation
it: Dettatura

# settings.expiration.footer
source: Choose whether to use the calendar or dictation for the expiration date.
it: Scegli se usare il calendario o la dettatura per la data di scadenza.

# trophy.title
source: Trophies
it: Trofei

# trophy.subtitle
source: Unlock trophies by managing your fridge well.
it: Sblocca i trofei gestendo bene il tuo frigo.

# trophy.unlocked_on
source: Unlocked on %@
it: Sbloccato il %@

# trophy.locked
source: Unlockable
it: Sbloccabile

# trophy.first_step
source: First step
it: Primo passo

# trophy.first_step_desc
source: You added your first product.
it: Hai aggiunto il primo prodotto.

# trophy.full_fridge
source: Full fridge
it: Frigo pieno

# trophy.full_fridge_desc
source: You had 10 products in inventory.
it: Hai avuto 10 prodotti in inventario.

# trophy.fridgy_friend
source: Fridgy's friend
it: Amico di Fridgy

# trophy.fridgy_friend_desc
source: 3 days in a row with no waste.
it: 3 giorni di fila senza sprechi.

# trophy.week_clean
source: Clean week
it: Settimana pulita

# trophy.week_clean_desc
source: 7 days in a row with no waste.
it: 7 giorni di fila senza sprechi.

# trophy.careful_consumer
source: Careful consumer
it: Consumatore attento

# trophy.careful_consumer_desc
source: 5 products consumed in time in one month.
it: 5 prodotti consumati in tempo in un mese.

# trophy.waste_fighter
source: Waste fighter
it: Anti-spreco

# trophy.waste_fighter_desc
source: Waste score ≥ 80% in one month.
it: Waste score ≥ 80% in un mese.

# trophy.master
source: Master
it: Maestro

# trophy.master_desc
source: You unlocked all trophies.
it: Hai sbloccato tutti i trofei.

# trophy.banner.title
source: Trophy unlocked!
it: Trofeo sbloccato!

# trophy.progress.add_one
source: Add 1 product
it: Aggiungi 1 prodotto

# trophy.progress.done
source: Done!
it: Completato!

# trophy.progress.products
source: %d / %d products
it: %d / %d prodotti

# trophy.progress.days_streak
source: %d / %d days no waste
it: %d / %d giorni senza sprechi

# trophy.progress.consumed_month
source: %d / %d consumed in time this month
it: %d / %d consumati in tempo questo mese

# trophy.progress.waste_need_more
source: Need at least 3 items this month
it: Servono almeno 3 elementi questo mese

# trophy.progress.waste_score
source: %d%% (need 80%%)
it: %d%% (serve 80%%)
