Repository: SAzzinelli/FoodFade
Catalog: *.lproj/Localizable.strings
Languages: it

# trophy.progress.master
source: %d / %d trophies unlocked
it: %d / %d trofei sbloccati

# trophy.level.products
source: products
it: prodotti inseriti

# trophy.level.days
source: days
it: giorni senza sprechi

# trophy.level.consumed
source: consumed in time
it: consumati in tempo

# trophy.level.trophies
source: trophies
it: trofei

# trophy.levels.title
source: Levels
it: Livelli
