Repository: SAzzinelli/FoodFade
Catalog: *.lproj/Localizable.strings
Languages: it

# common.save
source: Save
it: Salva

# common.cancel
source: Cancel
it: Annulla

# common.delete
source: Delete
it: Elimina

# common.edit
source: Edit
it: Modifica

# common.add
source: Add
it: Aggiungi

# common.search
source: Search
it: Cerca

# common.all
source: All
it: Tutti

# common.close
source: Close
it: Chiudi

# common.done
source: Done
it: Fatto

# common.annulla
source: Cancel
it: Annulla

# common.salva
source: Save
it: Salva

# error.save_failed
source: Save failed
it: Salvataggio non riuscito

# error.save_failed_message
source: Your changes could not be saved. Try again.
it: Le modifiche non sono state salvate. Riprova.

# error.delete_failed
source: Delete failed
it: Eliminazione non riuscita

# error.delete_failed_message
source: The item could not be deleted. Try again.
it: L'elemento non è stato eliminato. Riprova.

# itemdetail.scade_il
source: Expires
it: Scade il

# itemdetail.added_on
source: Added on
it: Aggiunto il

# itemdetail.last_update
source: Last update
it: Ultimo aggiornamento

# itemdetail.fresh_product
source: Fresh product
it: Prodotto fresco

# itemdetail.opens_in_3
source: Expires in 3 days
it: Scade dopo 3 giorni

# itemdetail.opened_product
source: Opened product
it: Prodotto aperto

# itemdetail.advanced_expiry
source: Advanced expiry
it: Gestione avanzata

# itemdetail.notes
source: Notes
it: Note

# itemdetail.barcode
source: Barcode
it: Codice a barre

# itemdetail.edit
source: Edit
it: Modifica

# itemdetail.delete
source: Delete
it: Elimina

# itemdetail.delete_confirm
source: Are you sure you want to delete %@?
it: Sei sicuro di voler eliminare %@?

# itemdetail.consumed
source: Consumed
it: Consumato

# home.section.categories
source: Categories
it: Categorie

# home.section.recent
source: Recent products
it: Prodotti recenti

# home.smart_suggestions.title
source: Smart Suggestions
it: Suggerimenti Intelligenti

# home.smart_suggestions.subtitle
source: FoodFade analyzes your products and suggests when to consume them to reduce waste. Suggestions appear here based on your habits.
it: FoodFade analizza i tuoi prodotti e ti suggerisce quando consumarli per ridurre gli sprechi. I suggerimenti appaiono qui in base alle tue abitudini.

# home.reorder.title
source: Reorder summary cards
it: Riordina le card del Riepilogo

# home.reorder.subtitle
source: Choose the order of the four sections on the Home screen.
it: Decidi in che ordine mostrare le quattro sezioni nella schermata Home.

# stats.intro.title
source: Usage and waste summary.
it: Riepilogo di utilizzo e spreco.

# stats.intro.subtitle
source: Waste Score, charts and insights by category and time. To monitor your habits.
it: Waste Score, grafici e approfondimenti per categoria e tempi. Per monitorare le tue abitudini.

# stats.empty.title
source: No data available
it: Nessun dato disponibile

# stats.empty.subtitle
source: Add some products to get started
it: Aggiungi qualche prodotto per iniziare

# stats.period
source: In the period
it: Nel periodo

# stats.consumed_label
source: consumed
it: consumati

# stats.expired_label
source: expired
it: scaduti

# stats.chart.consumed_vs_expired
source: Comparison of consumed vs expired products
it: Confronto tra prodotti consumati e scaduti

# stats.chart.last_4_weeks
source: Last 4 weeks
it: Ultime 4 settimane

# stats.chart.consumed
source: Consumed
it: Consumati

# stats.chart.expired
source: Expired
it: Scaduti

# stats.details.most_added
source: Most added products
it: Prodotti più aggiunti

# stats.details.most_wasted
source: Most wasted products
it: Prodotti più sprecati

# stats.details.detail_later
source: Details will appear as you use the app
it: I dettagli compariranno man mano che usi l'app

# stats.details.added_times
source: added %d time(s)
it: aggiunto %d volte

# stats.details.volta
source: time
it: volta

# stats.details.volte
source: times
it: volte

# barcode.placeholder
source: Position the barcode here
it: Posiziona il codice a barre qui

# barcode.simulator.title
source: Device only
it: Solo su dispositivo reale

# barcode.simulator.message
source: Barcode scanning is not available on the simulator. Use an iPhone or iPad to scan.
it: La scansione codici a barre non è disponibile sul simulatore. Usa un iPhone o iPad per scansionare.

# barcode.camera.denied.title
source: Camera not authorized
it: Fotocamera non autorizzata

# barcode.camera.denied.message
source: Enable camera access in Settings to scan barcodes.
it: Attiva l'accesso alla fotocamera in Impostazioni per scansionare i codici a barre.

# consumed_quantity_sheet.all
source: All (%d)
it: Tutti (%d)

# edit.section.product
source: Product
it: Prodotto

# edit.section.photo
source: Photo
it: Foto

# edit.section.category
source: Storage category
it: Categoria di conservazione

# edit.section.food_type
source: Food type
it: Tipo di alimento

# edit.section.expiry
source: Expiry
it: Scadenza

# edit.section.preferences
source: Preferences
it: Preferenze

# edit.fresh_product
source: Fresh product
it: Prodotto fresco

# edit.change_to_dated
source: Change to dated product
it: Cambia in prodotto con data

# edit.opened_on
source: Opened on
it: Aperto il

# home.greeting.morning
source: Good morning
it: Buongiorno

# home.greeting.afternoon
source: Good afternoon
it: Buon pomeriggio

# home.greeting.evening
source: Good evening
it: Buonasera

# home.greeting.ciao
source: Hi
it: Ciao

# home.subtitle.no_items
source: Start by adding your products
it: Inizia aggiungendo i tuoi prodotti

# home.subtitle.single
source: You have 1 product to manage
it: Hai 1 prodotto da gestire

# home.subtitle.multiple
source: You have %d products to manage
it: Hai %d prodotti da gestire

# home.progress.empty.title
source: Nothing here yet
it: Qui è tutto vuoto, per ora

# home.progress.empty.subtitle
source: Add a product and we'll start tracking expirations
it: Aggiungi un prodotto e iniziamo a tenere d'occhio le scadenze

# home.ring.legend.safe
source: How ahead of expirations you are
it: Quanto sei in anticipo sulle scadenze

# home.ring.legend.risk
source: How much needs checking
it: Quanto c'è da controllare

# home.ring.safe.all_ok
source: All under control
it: Tutto sotto controllo

# home.ring.safe.almost_ok
source: Almost there
it: Quasi perfetto

# home.ring.safe.few_safe
source: Needs attention
it: C'è da fare attenzione

# home.ring.safe.none_safe
source: Watch the expirations
it: Occhio alle scadenze

# home.ring.risk.none
source: No issues
it: Nessun problema

# home.ring.risk.low
source: Very little to check
it: Poco da controllare

# home.ring.risk.medium
source: A few things to handle
it: Qualcosa da sistemare

# home.ring.risk.high
source: Needs attention
it: Serve attenzione

# home.ring.subtitle.safe.perfect
source: 😌 You're all set
it: 😌 Vai sereno, è tutto ok

# home.ring.subtitle.safe.urgent_one
source: 👀 One product needs a look
it: 👀 C'è un prodotto da controllare

# home.ring.subtitle.safe.urgent_many
source: 👀 A few products need a look
it: 👀 Ci sono alcuni prodotti da controllare

# home.ring.subtitle.safe.incoming
source: 📅 Some expirations are coming up
it: 📅 Qualche scadenza si avvicina

# home.ring.subtitle.safe.fallback
source: 🔍 Take a look at expirations
it: 🔍 Dai un'occhiata alle scadenze

# home.ring.subtitle.risk.none
source: 😊 All good here
it: 😊 Tutto tranquillo

# home.ring.subtitle.risk.one
source: ⚠️ One product not to forget
it: ⚠️ Un prodotto da non dimenticare

# home.ring.subtitle.risk.many
source: ⚠️ %d products to check
it: ⚠️ %d prodotti da controllare

# home.expiry_control.title
source: Expiry control centre
it: Centro controllo scadenze

# home.expiry_control.badge.calm
source: All clear
it: Tranquillo

# home.expiry_control.badge.attention
source: Attention
it: Attenzione

# home.expiry_control.badge.urgent
source: Urgent
it: Urgente

# home.expiry_control.badge.incoming
source: Coming up
it: In arrivo

# home.expiry_control.hero.under_control
source: All under control
it: Tutto sotto controllo

# home.expiry_control.hero.incoming
source: Some expirations coming up
it: Qualche scadenza in vista

# home.expiry_control.hero.to_check
source: %d to check
it: %d da controllare

# home.expiry_control.summary.today
source: today
it: oggi

# home.expiry_control.summary.tomorrow
source: tomorrow
it: domani

# home.expiry_control.summary.incoming
source: in the next few days
it: nei prossimi giorni

# home.oggi_per_te.title
source: Today for you
it: Oggi per te

# home.oggi_per_te.consume_today_one
source: %@ expires today
it: Il %@ scade oggi

# home.oggi_per_te.consume_today_many
source: %d products expire today
it: Hai %d prodotti che scadono oggi

# home.oggi_per_te.consume_tomorrow_one
source: %@ expires tomorrow
it: Il %@ scade domani

# home.oggi_per_te.consume_in_days_one
source: %@ expires within %d days
it: Il %@ scade entro %d giorni

# home.oggi_per_te.consume_tomorrow_many
source: %d products expire by tomorrow
it: Hai %d prodotti che scadono entro domani

# home.oggi_per_te.incoming_soon
source: Some expirations in the next few days
it: Qualche scadenza nei prossimi giorni

# home.oggi_per_te.fridge_ok
source: All under control 👌
it: Tutto sotto controllo 👌

# home.oggi_per_te.fridge_ok_alt1
source: You're good for today
it: Oggi puoi stare sereno

# home.oggi_per_te.fridge_ok_alt2
source: No rush today
it: Nessuna corsa contro il tempo

# home.oggi_per_te.no_urgency
source: No urgency today 👌
it: Nessuna urgenza oggi 👌

# home.rings.ok
source: OK
it: Prodotti OK

# home.rings.inscadenza
source: Expiring soon
it: In scadenza

# home.rings.scaduti
source: Expired
it: Scaduti

# home.rings.title
source: Currently at home
it: Attualmente in casa

# home.expiring.section.title
source: Products expiring soon
it: Prodotti in scadenza

# home.see.all
source: See all
it: Vedi tutti

# home.kpi.total
source: Total
it: Totale

# home.kpi.in_home
source: In home
it: In casa

# home.kpi.expired
source: Expired
it: Scaduti

# home.kpi.expiring
source: Expiring soon
it: In scadenza

# home.category.product
source: Product
it: Prodotto

# home.category.products
source: %d Products
it: %d Prodotti

# home.category.expiring
source: • %d expiring
it: • %d in scadenza

# home.category.all_ok
source: All ok
it: Tutto ok

# home.category.attention
source: Attention
it: Attenzione

# home.recent.added_today
source: Added today
it: Aggiunto oggi

# home.recent.added_yesterday
source: Added yesterday
it: Aggiunto ieri

# home.recent.empty
source: No recent products.
it: Nessun prodotto recente.

# nav.shopping
source: Shopping
it: Spesa

# nav.statistics
source: Statistics
it: Statistiche

# nav.settings
source: Settings
it: Impostazioni

# notification.action.mark_consumed
source: Mark as consumed
it: Segna come consumato

# notification.action.open_app
source: Open app
it: Apri app

# inventory.search.prompt
source: Search product...
it: Cerca prodotto...

# inventory.consumed
source: Consumed
it: Consumato

# inventory.mark.consumed
source: Mark as consumed
it: Segna come consumato

# consumed_quantity_sheet.prompt
source: How many did you consume?
it: Quanti ne hai consumati?

# item.day
source: 1 day
it: 1 giorno

# item.days
source: %d days
it: %d giorni

# item.accessibility.hint
source: Double tap to open details
it: Doppio tocco per aprire i dettagli

# itemdetail.title
source: Product detail
it: Dettaglio prodotto

# itemdetail.opened.button
source: Did you open it?
it: L'hai aperto?

# itemdetail.opened.label
source: Opened
it: Aperto

# itemdetail.opened_quantity.prompt
source: How many did you open?
it: Quante ne hai aperte?

# itemdetail.opened_quantity.confirm
source: Confirm
it: Conferma

# itemdetail.portion.closed
source: %d closed (expires %@)
it: %d chiuse (scadenza %@)

# itemdetail.portion.opened
source: %d opened (expires %@)
it: %d aperte (scadenza %@)

# itemdetail.portion.closed.count
source: %d closed
it: %d chiuse

# itemdetail.portion.opened.count
source: %d opened
it: %d aperte

# itemdetail.portion.expires
source: Expires %@
it: Scade il %@

# itemdetail.revert_to_unopened
source: Mark as unopened
it: Segna come da aprire

# itemdetail.expired_open_alert.title
source: Product expired
it: Prodotto scaduto

# itemdetail.expired_open_alert.message
source: This product is already expired. Do you still want to mark it as opened?
it: Questo prodotto è già scaduto. Vuoi segnarlo come aperto comunque?

# itemdetail.expired_consume_alert.title
source: Warning: product expired
it: Attenzione: prodotto scaduto

# itemdetail.expired_consume_alert.message
source: This product has expired. Do you want to mark it as consumed? Only consume it if you're sure it's safe.
it: Questo prodotto è scaduto. Vuoi segnarlo come consumato? Consumalo solo se sei sicuro delle condizioni.

# itemdetail.expired_consume_alert.confirm
source: Yes, mark as consumed
it: Sì, segna come consumato

# inventory.empty.title
source: No products
it: Nessun prodotto

# inventory.empty.subtitle
source: Add your first product to get started
it: Aggiungi il tuo primo prodotto per iniziare

# inventory.empty.button
source: Add Product
it: Aggiungi Prodotto

# inventory.category.empty
source: There are no products in this category.
it: Non ci sono prodotti in questa categoria.

# inventory.search.empty.title
source: No results
it: Nessun risultato

# inventory.search.empty.subtitle
source: No results for "%@". Try different terms.
it: Nessun risultato per "%@". Prova con altri termini.

# inventory.sort
source: Sort
it: Ordina

# inventory.sort.ascending
source: Ascending
it: Crescente

# inventory.sort.descending
source: Descending
it: Decrescente

# inventory.sort.expiration
source: Expiration date
it: Data scadenza

# inventory.sort.name_az
source: Name A–Z
it: Nome A–Z

# inventory.sort.category
source: Category
it: Categoria

# inventory.sort.quantity
source: Quantity
it: Quantità

# inventory.sort.added
source: Date added
it: Data aggiunta

# inventory.sort.price
source: Price
it: Prezzo

# inventory.results.count
source: %d products
it: %d prodotti

# inventory.total_items
source: Total items: %d
it: Totale elementi: %d

# recipe.title
source: Recipes
it: Ricette

# recipe.generate
source: Generate
it: Genera

# recipe.select_up_to
source: Select up to %d ingredients
it: Seleziona fino a %d ingredienti

# recipe.expiring_section
source: Expiring soon
it: In scadenza

# recipe.other_ingredients
source: Other ingredients
it: Altri ingredienti

# recipe.selected_count
source: %d/%d selected
it: %d/%d selezionati

# addfood.title
source: New Product
it: Nuovo Prodotto

# addfood.name
source: Product name
it: Nome prodotto

# addfood.name.placeholder
source: E.g. Yogurt, Milk ...
it: Es. Yogurt, Latte ...

# addfood.product.footer
source: Enter at least the name and an expiration date
it: Inserisci almeno il nome e una scadenza

# addfood.category
source: Where do you store it?
it: Dove lo conservi?

# addfood.foodtype
source: Food type
it: Tipo di alimento

# addfood.foodtype.optional
source: Category (optional)
it: Categoria (opzionale)

# addfood.foodtype.footer
source: Helps us give you more accurate statistics and suggestions
it: Ci aiuta a darti statistiche e suggerimenti più precisi

# addfood.foodtype.none
source: No category
it: Nessuna categoria

# addfood.foodtype.add
source: Add category...
it: Aggiungi categoria...

# addfood.foodtype.add.title
source: Add Category
it: Aggiungi Categoria

# addfood.foodtype.add.message
source: Enter the name of the new category
it: Inserisci il nome della nuova categoria

# addfood.foodtype.add.name
source: Category name
it: Nome categoria

# addfood.barcode
source: Barcode
it: Codice a barre

# addfood.barcode.footer
source: Scanning adds name, image and ingredients automatically. You need to enter the expiry date.
it: Con la scansione vengono aggiunti automaticamente nome, immagine e ingredienti. La scadenza devi inserirla tu.

# addfood.photo
source: Product photo
it: Foto prodotto

# addfood.photo.optional
source: Product photo (optional)
it: Foto prodotto (facoltativo)

# addfood.photo.take
source: Take Photo
it: Scatta Foto

# addfood.photo.library
source: Photo Library
it: Libreria Foto

# addfood.expiration
source: Expiration date
it: Data di scadenza

# addfood.expiration.placeholder
source: Enter expiry date
it: Inserisci data di scadenza

# addfood.quantity
source: Quantity: %d
it: Quantità: %d

# addfood.quantity_section
source: Quantity
it: Quantità

# addfood.price
source: Price
it: Prezzo

# addfood.price.placeholder
source: e.g. 2.50
it: es. 2,50

# addfood.price.footer
source: Track spending and see savings in Statistics.
it: Tieni d'occhio la spesa e i risparmi nelle Statistiche.

# addfood.notes
source: Notes (optional)
it: Note (opzionale)

# addfood.notify
source: Notifications
it: Notifiche

# tags.section
source: Tags
it: Tag

# tags.gluten_free
source: Gluten-free
it: Senza glutine

# tags.bio
source: Organic
it: Bio

# tags.vegan
source: Vegan
it: Vegano

# tags.vegetarian
source: Vegetarian
it: Vegetariano

# tags.lactose_free
source: Lactose-free
it: Senza lattosio

# tags.ready
source: Ready
it: Pronto

# tags.to_cook
source: To cook
it: Da cucinare

# tags.artisan
source: Artisan
it: Artigianale

# tags.single_portion
source: Single portion
it: Monoporzione

# tags.multi_portion
source: Multi portion
it: Multiporzione

# addfood.labels
source: Labels
it: Etichette

# tags.footer
source: We'll use these tags to filter your inventory and provide suggestions.
it: Useremo questi tag per filtrare il tuo inventario e fornirti suggerimenti.

# tags.filter_all
source: All
it: Tutti

# tags.filter_opened
source: Opened
it: Aperto

# history.title
source: Consumed history
it: Storico consumi

# history.today
source: Today
it: Oggi

# history.yesterday
source: Yesterday
it: Ieri

# history.this_week
source: This week
it: Questa settimana

# history.empty.title
source: No consumed items
it: Nessun consumo

# history.empty.subtitle
source: Items you mark as consumed will appear here.
it: I prodotti che segni come consumati appariranno qui.

# history.older
source: Earlier
it: Precedenti

# history.delete_all
source: Delete all
it: Elimina tutti

# history.delete_all.message
source: Delete all items from consumed history? This cannot be undone.
it: Vuoi eliminare tutti gli oggetti dallo storico consumi? Questa azione non può essere annullata.

# shopping.title
source: Shopping list
it: Lista della spesa

# shopping.add.placeholder
source: What to buy?
it: Cosa comprare?

# shopping.empty.title
source: List is empty
it: Lista vuota

# shopping.empty.subtitle
source: Add items you need to buy.
it: Aggiungi cosa devi comprare.

# shopping.add_from_consumed
source: Add from consumed
it: Aggiungi da consumati

# shopping.export_reminders
source: Add to Reminders
it: Aggiungi a Promemoria

# shopping.completed
source: Completed
it: Completati

# shopping.archived
source: Archived
it: Archiviati

# shopping.purchased_section
source: Purchased
it: Acquistati

# shopping.mark_bought
source: Mark bought
it: Segna comprato

# shopping.purchased
source: Purchased
it: Acquistato

# shopping.list.change_icon
source: Change icon
it: Cambia icona

# shopping.list.count
source: %d items
it: %d voci

# shopping.lists.empty.title
source: No lists
it: Nessuna lista

# shopping.lists.empty.subtitle
source: Create your first shopping list.
it: Crea la tua prima lista della spesa.

# shopping.lists.new
source: New list
it: Nuova lista

# shopping.list.name.placeholder
source: List name
it: Nome lista

# shopping.list.default_name
source: Main list
it: Lista principale

# shopping.list.rename
source: Rename list
it: Modifica lista

# shopping.list.rename.hint
source: Enter the new name for the list.
it: Inserisci il nuovo nome della lista.

# category.fridge
source: Refrigerator
it: Frigorifero

# category.freezer
source: Freezer
it: Congelatore

# category.pantry
source: Pantry
it: Dispensa

# foodtype.vegetables
source: Vegetables
it: Verdure

# foodtype.fruits
source: Fruits
it: Frutta

# foodtype.dairy
source: Dairy
it: Latticini

# foodtype.meat
source: Meat
it: Carne

# foodtype.fish
source: Fish
it: Pesce

# foodtype.rice
source: Rice
it: Riso

# foodtype.bread
source: Bread
it: Pane

# foodtype.sauces
source: Ready sauces
it: Sughi pronti

# foodtype.beverages
source: Beverages
it: Bevande

# foodtype.snacks
source: Snacks
it: Snack

# foodtype.frozen
source: Frozen
it: Surgelati

# foodtype.canned
source: Canned
it: Conserve

# foodtype.other
source: Other
it: Altro

# stats.title
source: Statistics
it: Statistiche

# stats.food_waste
source: Food waste
it: Spreco del cibo

# stats.categories
source: Categories
it: Categorie

# stats.how_long_products
source: How long you keep products
it: Quanto tieni i prodotti

# stats.how_long.avg_title
source: On average you use them after
it: In media li consumi dopo

# stats.how_long.day
source: day
it: giorno

# stats.how_long.days
source: days
it: giorni

# stats.how_long.footer
source: Average based on products you marked as consumed.
it: Media calcolata sui prodotti che hai segnato come consumati.

# stats.in_detail
source: In detail
it: Nel dettaglio

# stats.consumed
source: consumed
it: consumati

# stats.this_month
source: This month
it: Questo mese

# stats.consumed_items
source: Consumed
it: Consumati

# stats.expiring_soon
source: Expiring soon
it: In scadenza

# stats.expired
source: Expired
it: Scaduti

# stats.most_wasted
source: Most wasted types
it: Tipi più sprecati

# stats.by_category
source: By category
it: Per categoria

# stats.section.in_brief
source: In a nutshell
it: In breve

# stats.section.tip
source: An idea for you
it: Un'idea per te

# stats.section.data
source: Your data
it: I tuoi dati

# stats.used_vs_wasted.description
source: Here you see how much you used in time versus what expired. A quick way to understand if you're on top of things or if something often slips past the date.
it: Qui vedi quanto hai usato in tempo e quanto è scaduto. Un colpo d'occhio per capire se sei in pari con le scadenze o se qualcosa spesso va a scadere.

# stats.by_category.description
source: Stats by where you store food: fridge, freezer, pantry. See where you use things in time and where they tend to expire—handy to adjust habits in one place.
it: Le statistiche per dove conservi: frigo, congelatore, dispensa. Scopri dove usi tutto in tempo e dove qualcosa scade—utile per aggiustare le abitudini.

# stats.section.content
source: Content
it: Contenuto

# stats.section.instructions
source: Instructions
it: Istruzioni

# stats.what_is
source: What is it?
it: Cos'è?

# stats.waste_score.description
source: A simple way to see how well you're using food before it expires. When it's high, you're doing great; when it's low, a few things are getting away. Check dates and plan a bit—it helps.
it: Un modo semplice per capire quanto stai usando il cibo prima che scada. Se è alto vai bene, se è basso qualcosa sta scadendo. Dai un'occhiata alle date e pianifica un po'—aiuta.

# stats.details.description
source: What you add most and what often expires unused. Helps you notice patterns—like buying too much of something or forgetting it in the back—so you can tweak and waste less.
it: Cosa aggiungi di più e cosa spesso scade senza essere usato. Ti aiuta a notare le abitudini—ad esempio comprare troppo qualcosa o dimenticarlo in fondo—così puoi correggere e sprecare meno.

# stats.fridgy_off_tip
source: Turn on Fridgy in Settings to get personalised tips here.
it: Attiva Fridgy nelle Impostazioni per ricevere qui consigli su misura.

# stats.advice
source: Tips for you
it: Consigli per te

# stats.message.excellent
source: Great job! You're reducing waste.
it: Ottimo lavoro! Stai riducendo gli sprechi.

# stats.message.good
source: You're doing well! Keep it up.
it: Stai facendo bene! Continua così.
